RSN/src/DataProcessors/ПолучитьОтправитьДанныеПоОбъекту/ПолучитьОтправитьДанныеПоОбъекту.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ПолучитьОтправитьДанныеПоОбъекту</name>
</mdclass:DataProcessor>

RSN/src/InformationRegisters/Мастерданные/Мастерданные.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Мастерданные</name>
  <resources>
    <name>Содержание</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <attributes>
    <name>Представление</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Источник</name>
    <type>
      <types>CatalogRef.ИнформационныеБазы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОбъектМетаданных</name>
    <type>
      <types>CatalogRef.ОбъектыМетаданныхИнформационныхБаз</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Идентификатор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

RSN/src/DataProcessors/ПолучитьОтправитьДанныеПоОбъекту/Forms/Форма/Module.bsl
#Область ОбработчикиСобытийФормы   

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ОбъектМетаданных") Тогда
		ОбъектМетаданных = Параметры.ОбъектМетаданных;	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	НастройкиАвторизации = ИнтеграцияКлиент.ПолучитьНастройкиАвторизации();
КонецПроцедуры 

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ИзменениеНастроекАвторизации" Тогда		
		НастройкиАвторизации = ИнтеграцияКлиент.ПолучитьНастройкиАвторизации();		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти 

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ИБПриИзменении(Элемент)
	СформироватьСтрокуПодключения();
КонецПроцедуры 

&НаКлиенте
Процедура ОбъектМетаданныхПриИзменении(Элемент)
	СформироватьСтрокуПодключения();
КонецПроцедуры

&НаКлиенте 
Процедура ПолучитьДанные(Команда)
	
	ОчиститьСообщения();
	Если Не ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
		
	ПолучитьДанныеНаСервере(); 
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьРегистрациюБазы(Команда)
	ВыполнитьРегистрациюБазыНаВебСервере();
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьФильтр(Команда)
	
	ОбработкаОповещения = Новый ОписаниеОповещения("ПриЗакрытииФормыНастройкиФильтров", ЭтаФорма);
	ОткрытьФорму("Обработка.ПолучитьОтправитьДанныеПоОбъекту.Форма.НастройкаФильтров",Новый Структура("ПараметрыЗапросаСтрокой",ПараметрыЗапросаСтрокой),ЭтаФорма,ЭтаФорма.УникальныйИдентификатор,,,
													ОбработкаОповещения,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);	
		
КонецПроцедуры

#КонецОбласти   

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПолучитьДанныеНаСервере() 
	
	ВыполнитьРегистрациюБазыНаВебСервере();
	
	Если НастройкиАвторизации.ИспользуетсяАутентификацияОС Тогда 
		Аутентификация = Новый Структура("Аутентификация", КоннекторHTTP.НоваяАутентификацияОС());		
	Иначе                                                    
		Аутентификация = Новый Структура("Аутентификация", Новый Структура("Пользователь, Пароль", НастройкиАвторизации.ИмяПользователя, НастройкиАвторизации.Пароль));	
	КонецЕсли;
	
	//NoDeletionMark,ElementsOnly
	ПараметрыЗапроса = ЗаполнитьПараметрыЗапроса();
	
	//делаем задержку, чтобы база "успела" зарегистрироваться. 
	Если ЗначениеЗаполнено(ВремяРегистрацииНаВебСервере) Тогда
		
		ДлительностьОбработки = 7; //в секундах 
		Пока ТекущаяДатаСеанса() < ВремяРегистрацииНаВебСервере + ДлительностьОбработки Цикл	
		КонецЦикла;
				
	КонецЕсли;
	
	Если ПеререгистрироватьОбъектМетаданных Тогда
		ПараметрыОбработчика = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ОбъектМетаданных, "Владелец, ПредставлениеВСервисе");
		ПараметрыРегистрацииОбработчика = Интеграция.ПараметрыРегистрацииИзБазы(ПараметрыОбработчика.Владелец, ПараметрыОбработчика.ПредставлениеВСервисе);
		
		СтруктураСсылки = ОбщегоНазначенияКлиентСервер.СтруктураURI(СтрокаПодключения);  
		ПутьКБазе = СтруктураСсылки.Хост + "/" + Лев(СтруктураСсылки.ПутьНаСервере, СтрНайти(СтруктураСсылки.ПутьНаСервере, "/")-1);
		
		Интеграция.ЗарегистрироватьОбъектМетаданных(ПутьКБазе, Аутентификация, ПараметрыРегистрацииОбработчика);
	КонецЕсли; 
	
	Попытка
		Ответ = КоннекторHTTP.Get(СтрокаПодключения,ПараметрыЗапроса,Аутентификация);
		ТекстОтвета = КоннекторHTTP.КакТекст(Ответ, КодировкаТекста.UTF8);
	Исключение
		ОбщегоНазначения.СообщитьПользователю(ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));	
	КонецПопытки;
	
	УдалитьРегистрациюБазыНаВебСервере();

КонецПроцедуры 

&НаСервере
Процедура ВыполнитьРегистрациюБазыНаВебСервере()  
	
	Если Не (Не ЗначениеЗаполнено(ИБ.ПутьНаВебСервере) И ЗначениеЗаполнено(ТекстСкриптаРегистрацииНаВебСервере)) Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыСкрипта = РазобратьСтрокуПараметров(ТекстСкриптаРегистрацииНаВебСервере);
	
	ИмяКаталога = ПараметрыСкрипта.dir;
	КаталогНаДиске = Новый Файл(ИмяКаталога);
	Если КаталогНаДиске.Существует() Тогда
		ВызватьИсключение "Операция прервана. Такой каталог уже существует """ + ИмяКаталога + """, возможно в нем опубликована другая база.";
	КонецЕсли;   
		
	СоздатьКаталог(ИмяКаталога);
	
	ШаблонПубликации = ПолучитьОбщийМакет(Метаданные.ОбщиеМакеты.ШаблонПубликацииБазыНаВебСервере);
	ШаблонПубликации.Записать(ПараметрыСкрипта.descriptor); 
	
	Попытка
		WshShell = Новый COMОбъект("Wscript.Shell");
		WshShell.Exec(СокрЛП(ТекстСкриптаРегистрацииНаВебСервере));
	Исключение 
		ОбщегоНазначения.СообщитьПользователю(ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		WshShell = Неопределено;		
	КонецПопытки;                                            
	
	ВремяРегистрацииНаВебСервере = ТекущаяДатаСеанса();	
	
КонецПроцедуры  

&НаСервере
Процедура УдалитьРегистрациюБазыНаВебСервере()  
	
	Если Не (Не ЗначениеЗаполнено(ИБ.ПутьНаВебСервере) И ЗначениеЗаполнено(ТекстСкриптаРегистрацииНаВебСервере)) Тогда
		Возврат;
	КонецЕсли;
	
	ТекстСкриптаУдаления = Сред(СокрЛП(ТекстСкриптаРегистрацииНаВебСервере), 1, СтрНайти(СокрЛП(ТекстСкриптаРегистрацииНаВебСервере), "-dir")-1); 
	ТекстСкриптаУдаления = СтрЗаменить(ТекстСкриптаУдаления, "publish", "delete");	
	
	Попытка
		WshShell = Новый COMОбъект("Wscript.Shell");
		WshShell.Exec(ТекстСкриптаУдаления);
	Исключение 
		ОбщегоНазначения.СообщитьПользователю(ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		WshShell = Неопределено;		
	КонецПопытки;
	
	ПараметрыСкрипта = РазобратьСтрокуПараметров(ТекстСкриптаРегистрацииНаВебСервере); 
	УдалитьФайлы(ПараметрыСкрипта.dir);
	
	ВремяРегистрацииНаВебСервере = Дата("00010101");
	
КонецПроцедуры

&НаСервере
Функция ЗаполнитьПараметрыЗапроса()
	
	ПараметрыЗапроса = Новый Структура;
	
	Если Не ПараметрыЗапросаСтрокой = "" Тогда
		МассивПодстрок = СтрРазделить(ПараметрыЗапросаСтрокой, ";");
		Для каждого Стр из МассивПодстрок Цикл 
			ЧастиПараметра = СтрРазделить(Стр, "=");
			ПараметрыЗапроса.Вставить(ЧастиПараметра[0], ЧастиПараметра[1]); 	
		КонецЦикла;		
	КонецЕсли;	
	
	Возврат ПараметрыЗапроса;

КонецФункции

&НаСервере
Процедура СформироватьСтрокуПодключения()     
	
	РеквизитыИБ = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ИБ, "Наименование, СерверПриложений, ПутьНаВебСервере");
	
	Запрос = Новый Запрос;  
	Запрос.УстановитьПараметр("ОбъектМетаданных", ОбъектМетаданных);
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОбъектыМетаданныхИнформационныхБаз.Владелец.Код КАК ВладелецКод,
		|	ОбъектыМетаданныхИнформационныхБаз.ПредставлениеВСервисе КАК ПредставлениеВСервисе
		|ИЗ
		|	Справочник.ОбъектыМетаданныхИнформационныхБаз КАК ОбъектыМетаданныхИнформационныхБаз
		|ГДЕ
		|	ОбъектыМетаданныхИнформационныхБаз.Ссылка = &ОбъектМетаданных";
	
	Выборка = Запрос.Выполнить().Выбрать();	
	Выборка.Следующий();       
	                             
	СтрокаСоединения = СтроковыеФункцииКлиентСервер.ПараметрыИзСтроки(СтрокаСоединенияИнформационнойБазы());
	
	ПутьКНезарегистрированнойБазе = "http://" + СтрокаСоединения.Srvr + "/" + РеквизитыИБ.Наименование;
	
	СтрокаПодключения = ?(ЗначениеЗаполнено(РеквизитыИБ.ПутьНаВебСервере), РеквизитыИБ.ПутьНаВебСервере, ПутьКНезарегистрированнойБазе)  + "/hs/um/" + Выборка.ВладелецКод + "/" + Выборка.ПредставлениеВСервисе;	 
	
	ИБНеЗарегистрированаНаВебСервере = ЗначениеЗаполнено(ОбъектМетаданных) И ЗначениеЗаполнено(ИБ) И Не ЗначениеЗаполнено(РеквизитыИБ.ПутьНаВебСервере);
	
	Элементы.НадписьПредупреждениеОРегистрации.Видимость = ИБНеЗарегистрированаНаВебСервере;
	Элементы.ТекстСкриптаРегистрацииНаВебСервере.Видимость = ИБНеЗарегистрированаНаВебСервере;
	
	Если Не ИБНеЗарегистрированаНаВебСервере Тогда	
		ТекстСкриптаРегистрацииНаВебСервере = "";
		ПеререгистрироватьОбъектМетаданных = Ложь;
		Возврат;
	КонецЕсли;
	
	ПеререгистрироватьОбъектМетаданных = Истина;
	
	//https://its.1c.ru/db/v8325doc#bookmark:adm:TI000000201	
	СисИнфо = Новый СистемнаяИнформация;
	webinst = СтрШаблон("""C:\Program Files\1cv8\%1\bin\webinst.exe""", СисИнфо.ВерсияПриложения);	
	wsdir = РеквизитыИБ.Наименование; 
	dir = СтрШаблон("""C:\inetpub\wwwroot\%1""", РеквизитыИБ.Наименование);
	connstr = СтрШаблон("""Srvr=%1;Ref=%2;""", РеквизитыИБ.СерверПриложений, РеквизитыИБ.Наименование);
	descriptor = """C:\inetpub\wwwroot\template.vrd"""; 
	
	ТекстСкриптаРегистрацииНаВебСервере = СтрШаблон("%1 -publish -iis -wsdir %2 -dir %3 -connstr %4 -descriptor %5", webinst, wsdir, dir, connstr, descriptor);
		
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьВРегистр(Команда)
	ЗаписатьВРегистрНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаписатьВРегистрНаСервере() 
	
	Джэйсон = JSONПрочитать(ТекстОтвета);
	Для Каждого Стр Из Джэйсон Цикл
		Запись = РегистрыСведений.Мастерданные.СоздатьМенеджерЗаписи();
		Запись.Источник = ИБ;
		Запись.ОбъектМетаданных = ОбъектМетаданных; 
		Запись.Идентификатор = Стр.Ссылка;
		Запись.Представление = Стр.СсылкаПредставление;
		Запись.Содержание = JSONЗаписать(Стр);      
		Запись.Записать();
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция JSONПрочитать(Строка, ИменаСвойствТипаДата = "") Экспорт
	
	JSON = Новый ЧтениеJSON();
	JSON.УстановитьСтроку(Строка);
	
	Результат = ПрочитатьJSON(JSON, Ложь, СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ИменаСвойствТипаДата,,, Истина));
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция JSONЗаписать(Значение) Экспорт
	
	Если Значение = Неопределено Тогда
		Возврат "";
	КонецЕсли;
	
	JSON = Новый ЗаписьJSON();
	JSON.УстановитьСтроку();
	
	ЗаписатьJSON(JSON, Значение);
	
	Результат = JSON.Закрыть();
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура ЗарегистрироватьОбъектНаСервере()
	
	Если НастройкиАвторизации.ИспользуетсяАутентификацияОС Тогда 
		Аутентификация = Новый Структура("Аутентификация", КоннекторHTTP.НоваяАутентификацияОС());		
	Иначе                                                    
		Аутентификация = Новый Структура("Аутентификация", Новый Структура("Пользователь, Пароль", НастройкиАвторизации.ИмяПользователя, НастройкиАвторизации.Пароль));	
	КонецЕсли; 
	
	ПараметрыЗапроса = Новый Структура("ПараметрыЗапроса", ЗаполнитьПараметрыЗапроса());		
	ОбщегоНазначенияКлиентСервер.ДополнитьСтруктуру(ПараметрыЗапроса, Аутентификация);
	
	Ответ = КоннекторHTTP.Post(СтрокаПодключения, ТекстОтвета, ПараметрыЗапроса);
	ОбщегоНазначения.СообщитьПользователю(КоннекторHTTP.КакТекст(Ответ, КодировкаТекста.UTF8));
	
КонецПроцедуры

&НаКлиенте
Процедура ЗарегистрироватьОбъект(Команда)
	ЗарегистрироватьОбъектНаСервере();
КонецПроцедуры

&НаСервере
Функция РазобратьСтрокуПараметров(СтрокаКоманд)
    СтруктураПараметров = Новый Структура;

    // Добавим пробел в конец, чтобы корректно обработать последний параметр
    СтрокаКоманд = СтрокаКоманд + " ";

    ТекущийПараметр = "";
    ТекущееЗначение = "";
    ВКавычках = Ложь;
    СледуетИмя = Ложь;
    
    Для Сч = 1 По СтрДлина(СтрокаКоманд) Цикл
        Символ = Сред(СтрокаКоманд, Сч, 1);

        // Переключаем флаг кавычек
        Если Символ = """" Тогда
            ВКавычках = Не ВКавычках;
            Продолжить;
        КонецЕсли;

        // Проверяем: новое имя параметра начинается с дефиса после пробела и не внутри кавычек
        Если Не ВКавычках И Символ = "-" И (Сч = 1 Или Сред(СтрокаКоманд, Сч - 1, 1) = " ") Тогда
            // Сохраняем предыдущую пару, если была
            Если ТекущийПараметр <> "" Тогда
                ТекущееЗначение = СокрЛП(СокрП(ТекущееЗначение));
                СтруктураПараметров.Вставить(СтрЗаменить(ТекущийПараметр, "-", ""), ТекущееЗначение);
            КонецЕсли;

            // Начинаем новый параметр
            ТекущийПараметр = "-";
            ТекущееЗначение = "";
            СледуетИмя = Истина;
            Продолжить;
        КонецЕсли;

        // Заполняем имя параметра
        Если СледуетИмя Тогда
            Если Символ <> " " Тогда
                ТекущийПараметр = ТекущийПараметр + Символ;
            Иначе
                СледуетИмя = Ложь;
            КонецЕсли;
            Продолжить;
        КонецЕсли;

        // Если уже есть имя — копим значение (включая дефисы и пробелы)
        Если ТекущийПараметр <> "" Тогда
            ТекущееЗначение = ТекущееЗначение + Символ;
        КонецЕсли;
    КонецЦикла;

    // Добавляем последний параметр, если есть
    Если ТекущийПараметр <> "" Тогда
        ТекущееЗначение = СокрЛП(СокрП(ТекущееЗначение));
        СтруктураПараметров.Вставить(СтрЗаменить(ТекущийПараметр, "-", ""), ТекущееЗначение);
    КонецЕсли;

    Возврат СтруктураПараметров;
КонецФункции

&НаКлиенте
Процедура ПриЗакрытииФормыНастройкиФильтров(Результат, ДополнительныеПараметры) Экспорт 
	
	Если Результат = Неопределено Тогда
		Возврат;	
	КонецЕсли; 	
	
	ПараметрыЗапросаСтрокой = "Filters=" +ЗаписатьЗначениеJSON(Результат);
			
КонецПроцедуры

#КонецОбласти
